# pandas library 

Data Inspection

In [99]:
import pandas as pd

df=pd.read_excel(r"D:\Gradtwin\Gradtwin-Works\demo.xlsx")
df.head(2)     #default agrument 5

       name   age  cgpa
0  Srikanth  21.0   9.1
1    Surya   20.0   9.8

In [59]:
df.tail(2)

      name  age  cgpa
3  Sharan    25  9.45
4     Bala   24  8.75

In [61]:
df.sample()

     name  age  cgpa
1  Surya    20   9.8

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   cgpa    5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes

In [63]:
df.describe(include='all')     #describe the statistical inference of the given dataframe

            name        age      cgpa
count          5   5.000000  5.000000
unique         5        NaN       NaN
top     Srikanth        NaN       NaN
freq           1        NaN       NaN
mean         NaN  22.000000  9.360000
std          NaN   2.345208  0.435029
min          NaN  20.000000  8.750000
25%          NaN  20.000000  9.100000
50%          NaN  21.000000  9.450000
75%          NaN  24.000000  9.700000
max          NaN  25.000000  9.800000

In [64]:
print(df.to_records())

[(0, 'Srikanth', 21, 9.1 ) (1, 'Surya ', 20, 9.8 ) (2, 'Navin', 20, 9.7 )
 (3, 'Sharan ', 25, 9.45) (4, 'Bala', 24, 8.75)]

In [65]:
df.describe(include='object')

            name
count          5
unique         5
top     Srikanth
freq           1

In [100]:
df.shape   #property or attribute of the df class
df.isnull()

    name    age   cgpa
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False   True  False

# Business insights